
public class Main {
    //Проверка кода называется тестированием. Подробно вы изучите эту тему дальше в курсе. Тем не менее,
    // сам процесс тестирования можно начать уже сейчас.
    // Создайте в классе Main метод static void main(String[] args) и внутри него:
    public static void main(String[] args) {
        //Создайте две задачи, а также эпик с двумя подзадачами и эпик с одной подзадачей.

        //Распечатайте списки эпиков, задач и подзадач через System.out.println(..)

        //Измените статусы созданных объектов, распечатайте их.
        // Проверьте, что статус задачи и подзадачи сохранился, а статус эпика рассчитался по статусам подзадач.

        //И, наконец, попробуйте удалить одну из задач и один из эпиков.

    }





}
